Revit 2027 API
ElementId(BuiltInParameter) Constructor
 Create an ElementId handle with the given BuiltInParameter id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId(
	BuiltInParameter parameterId
)
Public Sub New (
	parameterId As BuiltInParameter
)
public:
ElementId(
	BuiltInParameter parameterId
)
new :
        parameterId : BuiltInParameter -> ElementId
Parameters
parameterId BuiltInParameter
The id.
See Also
Reference
ElementId Class
ElementId Overload
Autodesk.Revit.DB Namespace